"Back" = "Back";
"Continue" = "Continue without";
"create New User" = "Create new profile";
"Create New User Info" = "Here you can create a personal TimeFor.TV profile. This helps you store your settings between devices and gives you extra features.";
"create Your New Account" = "Create new profile";
"Email Address" = "Email address";
"Your Email Address" = "Email address";
"Login" = "Login";
"Login Subscribtion Info" = "To get access to the full features of TimeFor.TV we recommended that you login with a profile.";
"Mobile" = "Mobile no. for SMS reminders";
"Name" = "Name";
"Password" = "Password";
"Register Mobile for SMS Info" = "* Your mobile no. will be used if you wish to receive SMS reminders. Please visit timefor.tv/products/sms for detailed information and conditions.";
"Add Channels" = "Add channels";
"Channels" = "Channels";
"Channel.no.air.1" = "Airing break";
"Channel.no.air.2" = "Tab to see full day";
"Channel.no.transmission.1" = "No airings just now.";
"Channel.no.transmission.2" = "Tab to see full day";
"Edit Channels Navigation Title " = "Edit channels";
"Please Select Channels before Adding" = "Please select channels before adding";
"Save" = "Save";
"Search Channel" = "Search channels";
"Search Programs" = "Search the tv listings";
"Searched" = "Search";
"Shows" = "Shows:";
"Synching Channels" = "Fetching content";
"Today" = "Today";
"Logout" = "Log off";
"Logout Cell" = "You are logged in as";
"Push Notification Cell" = "Push notification devices";
"No Commercial" = "Disable commercials on TimeFor.TV";
"Recommendation" = "Recommendations";
"Recommend" = "Recommend";
"Don't recommend" = "Don't recommend";
"Select Date" = "Choose day";
"By Agent" = "By agent";
"Keyboard.done" = "Done";
"Segment.planned" = "Planned";
"Segment.agents" = "Agents";
"Edit planning" = "Edit planning";
"Add planning" = "Plan";
"Edit" = "Edit";
"Edit agent" = "Edit";
"Add notification" = "Add reminder";
"Search in" = "Search in";
"Original Title" = "Original title";
"Title" = "Title";
"Summary" = "Summary";
"All" = "All";
"Title or summary" = "Title or summary";
"Remind me" = "Remind me";
"Remind me via" = "Remind me through";
"Remind Time" = "Time";
"Remind me when it's aired" = "Remind me when it's aired";
"Plan every time it's aired" = "Plan every time";
"Select Days" = "Choose days";
"Search Target" = "Search in";
"Search Type" = "Search type";
"Select Channel" = "Choose channel";
"Minutes before" = "Minutes before";
"Hours before" = "Hours before";
"Days before" = "Days before";
"On days" = "On days";
"Weekdays(mon-fri)" = "Weekdays";
"Weekends(sat-sun)" = "Weekends";
"Mondays" = "Mondays";
"Tuesdays" = "Tuesdays";
"Wednesdays" = "Wednesdays";
"Thursdays" = "Thursdays";
"Fridays" = "Fridays";
"Saturdays" = "Saturdays";
"Sundays" = "Sundays";
"All weekdays" = "Anytime";
"All hours" = "Anytime";
"Is" = "is";
"Contains" = "contains";
"Begins with" = "begins with";
"Ends with" = "ends with";
"Between" = "Between";
"On" = "on";
"Show short summary in listings" = "Show short summary in listings";
"Settings" = "Settings";
"From" = "From";
"On channels" = "Channels";
"Plan all airings where" = "Plan all airings where";
"Limitations" = "Limitations";
"Plans" = "Planned";
"Plan" = "Plan";
"Find on IMDB" = "Search IMDb";
"Share on Facebook" = "Share on Facebook";
"You post is now shared" = "You post is now shared";
"No records found" = "There wasn't found any airings";
"Please provide us with a valid email address" = "Please enter a valid email address";
"Please fill name, email and password as minimum" = "Please fill name, email and password as minimum";
"Disable commercials on TimeFor.TV (apps)" = "Disable commercials on TimeFor.TV (apps)";
"Full version of TimeFor.TV for iPhone and iPad" = "Full version of TimeFor.TV for iPhone and iPad";
"Full version of TimeFor.TV for Android" = "Full version of TimeFor.TV for Android";
"Full version of TimeFor.TV for Windows" = "Full version of TimeFor.TV for Windows";
"Full version of TimeFor.TV for Facebook" = "Full version of TimeFor.TV for Facebook";
"Full version of TimeFor.TV for Mac" = "Full version of TimeFor.TV for Mac";
"Download EPG data as XMLTV for your media center" = "Download EPG data as XMLTV for your media center";
"Demands a TimeFor.TV Pro or TimeFor.TV+ subscription beginning at only EUR 5 an year" = "Demands a TimeFor.TV Pro or TimeFor.TV+ subscription beginning at only EUR 5 an year";
"Functions" = "Features";
"EUR 5/year" = "EUR 5/year";
"EUR 15/year" = "EUR 15/year";